'''Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону 
(т.е. не меньше заданного минимума и не больше заданного максимума). Список можно задавать рандомно
На входе : [ 1, 5, 88, 100, 2, -4]
33
200
Ответ: [2, 3]
'''
list_1 = [1, 5, 88, 100, 2, -4]
list_2 = []
max = 200
min = 33
# for i in range(len(lst_1)):
#     if list_1[i] >= min and list_1[i] <= max:
#         list_2.append(i)
# print(list_2)
# или
for i in range(len(list_1)):
    if min <= list_1[i] <= max:
        print(i, end=' ')