# Напишите программу, которая принимает на вход целое или дробное число и выдаёт количество цифр в числе.

n = int(input("Введите число:"))
count = 0
while(n > 0):
    count = count + 1
    n = n // 10
print("Количество цифр равно:", count)